Написать программу, которая вычисляет число pi с заданной пользователем точностью. Для вычисления значения числа pi воспользоваться формулой: pi = 4 * (1 - 1/3 + 1/5 - 1/7 + 1/9 - ...)


Определить какое количество дробей необходимо было добавить к сумме, чтобы обеспечить заданную точность. Запомнить кол-во, например в переменной N.

 

Рассмотрим произвольный квадрат с центром в начале координат и вписанный в него круг. Будем рассматривать только первую координатную четверть. В ней будет находиться четверть круга и четверть квадрата. Обозначим радиус круга R, тогда четверть квадрата тоже будет квадратом со стороной R. Будем случайным образом выбирать точки в этом квадрате и считать количество точек, попавших в четверть круга. Из теории вероятности известно, что отношение попаданий в четверть круга к попаданиям "в молоко" равно отношению площадей – pi/4.

Реализовать указанный алгоритм вычислений. Количество выбираемых точек N (вычислено ранее).

 

Сравнить вычисленные двумя способами значения числа pi. Можно сделать вывод какой способ сходится быстрее?


```

#include <iostream>
#include <cmath>
#include <time.h>

int main()
{
    double pi1, pi2, S = 0., exp, an = 1;
    int n = 0;
    std::cout << "Input exp:";
    std::cin >> exp;
    time_t tic1 = time(NULL);
    exp = abs(exp);
    for (int i = 1; abs(an) >= exp; ++i) {
        S += an;
        an = -((2. * i - 1.) * an) / (2. * i + 1.);
        n = i;
    }
    pi1 = 4. * S;
    time_t toc1 = time(NULL);
    int R, h = 0, m = 0;
    double x, y;
    std::cout << "Input radius:";
    std::cin >> R;
    time_t tic2 = time(NULL);
    R = abs(R);
    for (int j = 0; j < n; ++j) {
        x = rand() % (R + 1);
        y = rand() % (R + 1);
        if (x * x + y * y <= R * R) {
            ++h;
        }
        else ++m;
    }
    pi2 = double(h) / double(n) * 4.;
    time_t toc2 = time(NULL);
    std::cout << "First case = " << pi1 << " Fisrt time = " << toc1 - tic1  << "sec\n";
    std::cout << "Second case = " << pi2 << " Second time = " << toc2 - tic2 << "sec\n";
}
```
