Рассмотрим некоторое натуральное число n. Если оно четное, то разделим его на 2, иначе - умножим на 3 и прибавим 1. Будем повторять такие действия, пока не получится 1. 
	Полученная последовательность называется сиракузская последовательность, а наибольшее из чисел последовательности - её вершиной.
	Написать программу, вычисляющую для заданного n последовательность, подсчитывающую число шагов в ней и находящую её вершину.


```
#include <iostream>
int main()
{
    int n, _max = 0, k;
    std::cout << "Input n: ";
    std::cin >> n;
    for (int i = 1; n != 1; ++i) {
        if (n % 2 == 0) {
            _max = _max < n ? n : _max;
            n /= 2;
        }
        else {
            _max = _max < n ? n : _max;
            n = 3 * n + 1;
        }
        k = i;
    }
    std::cout << "Number of steps: " << k << std::endl << "Max value: " << _max << std::endl;
}
```
