Вавилоняне решили построить удивительную башню — расширяющуюся к верху и содержащую бесконечное число этажей и комнат. Она устроена следующим образом: на первом этаже одна комната, затем идет два этажа на каждом из которых по две комнаты, затем идёт три этажа, на каждом из которых по три комнаты и так далее. Эту башню решили оборудовать лифтом — и вот задача: нужно научится по номеру комнаты определять, на каком этаже она находится и какая она по счету слева на этом этаже.

Входные данные: номер комнаты N (1 ≤ N ≤ 2 000 000 000).

Выход: два целых числа — номер этажа и порядковый номер слева на этаже.

```
#include <iostream>

int main()
{
    int n, m = 1;
    do {
        std::cout << "Input number room: ";
        std::cin >> n;
    } while (n < 1);
    for (int i = 1; i <= n; ++i) {
        for (int j = 1; j <= i; ++j) {
            n -= i;
            ++m;
            if (n <= i) {
                std::cout << "Number floor: " << m << std::endl << "Number room: " << n << std::endl;
                return 0;
            }
        }
    }
    return 0;
}


```
